use slint::{SharedString, ToSharedString as _};

/// 最後の文字を消した値を返す
pub fn pop_player_name(old_text: impl Into<String>) -> SharedString {
    let mut text = old_text.into();
    let _last = text.pop();
    text.to_shared_string()
}

/// 大文字/小文字、濁点/半濁点などの変換をする。
///
/// Nintendo Switchの挙動を参考にしているが漏れがあるかも。
///
/// Nintendo Switchでは`う -> ぅ -> ヴ`、 `ウ -> ゥ -> ヴ`となっているが、処理を簡略化するために
/// `ぅ`の次を`ヴ`ではなく`う`にしている。(i.e. `ヴ`を入力したかったら`ゥ`から変換するしかない)
pub fn keyboard_modify(text: impl Into<String>) -> String {
    let mut text = text.into();
    let Some(last) = text.pop() else {
        return text;
    };
    let modified_char = match last {
        /*---------- ひらがな ----------*/
        // 小文字 -> 大文字
        'あ' => 'ぁ',
        'い' => 'ぃ',
        'う' => 'ぅ',
        'え' => 'ぇ',
        'お' => 'ぉ',
        'や' => 'ゃ',
        'ゆ' => 'ゅ',
        'よ' => 'ょ',
        // 大文字 -> 小文字
        'ぁ' => 'あ',
        'ぃ' => 'い',
        'ぅ' => 'う',
        'ぇ' => 'え',
        'ぉ' => 'お',
        'ゃ' => 'や',
        'ゅ' => 'ゆ',
        'ょ' => 'よ',
        // か行
        'か' => 'が',
        'き' => 'ぎ',
        'く' => 'ぐ',
        'け' => 'げ',
        'こ' => 'ご',
        'が' => 'か',
        'ぎ' => 'き',
        'ぐ' => 'く',
        'げ' => 'け',
        'ご' => 'こ',
        // さ行
        'さ' => 'ざ',
        'し' => 'じ',
        'す' => 'ず',
        'せ' => 'ぜ',
        'そ' => 'ぞ',
        'ざ' => 'さ',
        'じ' => 'し',
        'ず' => 'す',
        'ぜ' => 'せ',
        'ぞ' => 'そ',
        // た行
        'た' => 'だ',
        'ち' => 'ぢ',
        'つ' => 'っ',
        'っ' => 'づ',
        'て' => 'で',
        'と' => 'ど',
        'だ' => 'た',
        'ぢ' => 'ち',
        'づ' => 'つ',
        'で' => 'て',
        'ど' => 'と',
        // は行
        'は' => 'ば',
        'ひ' => 'び',
        'ふ' => 'ぶ',
        'へ' => 'べ',
        'ほ' => 'ぼ',
        'ば' => 'ぱ',
        'び' => 'ぴ',
        'ぶ' => 'ぷ',
        'べ' => 'ぺ',
        'ぼ' => 'ぽ',
        'ぱ' => 'は',
        'ぴ' => 'ひ',
        'ぷ' => 'ふ',
        'ぺ' => 'へ',
        'ぽ' => 'ほ',
        /*---------- カタカナ ----------*/
        // 大文字 -> 小文字
        'ア' => 'ァ',
        'イ' => 'ィ',
        'ウ' => 'ゥ',
        'エ' => 'ェ',
        'オ' => 'ォ',
        'ヤ' => 'ャ',
        'ユ' => 'ュ',
        'ヨ' => 'ョ',
        // 小文字 -> 大文字
        'ァ' => 'ア',
        'ィ' => 'イ',
        'ゥ' => 'ヴ',
        'ヴ' => 'ウ',
        'ェ' => 'エ',
        'ォ' => 'オ',
        'ャ' => 'ヤ',
        'ュ' => 'ユ',
        'ョ' => 'ヨ',
        // カ行
        'カ' => 'ガ',
        'キ' => 'ギ',
        'ク' => 'グ',
        'ケ' => 'ゲ',
        'コ' => 'ゴ',
        'ガ' => 'カ',
        'ギ' => 'キ',
        'グ' => 'ク',
        'ゲ' => 'ケ',
        'ゴ' => 'コ',
        // サ行
        'サ' => 'ザ',
        'シ' => 'ジ',
        'ス' => 'ズ',
        'セ' => 'ゼ',
        'ソ' => 'ゾ',
        'ザ' => 'サ',
        'ジ' => 'シ',
        'ズ' => 'ス',
        'ゼ' => 'セ',
        'ゾ' => 'ソ',
        // タ行
        'タ' => 'ダ',
        'チ' => 'ヂ',
        'ツ' => 'ッ',
        'ッ' => 'ヅ',
        'テ' => 'デ',
        'ト' => 'ド',
        'ダ' => 'タ',
        'ヂ' => 'チ',
        'ヅ' => 'ツ',
        'デ' => 'テ',
        'ド' => 'ト',
        // ハ行
        'ハ' => 'バ',
        'ヒ' => 'ビ',
        'フ' => 'ブ',
        'ヘ' => 'ベ',
        'ホ' => 'ボ',
        'バ' => 'パ',
        'ビ' => 'ピ',
        'ブ' => 'プ',
        'ベ' => 'ペ',
        'ボ' => 'ポ',
        'パ' => 'ハ',
        'ピ' => 'ヒ',
        'プ' => 'フ',
        'ペ' => 'ヘ',
        'ポ' => 'ホ',
        _ => last,
    };
    text.push(modified_char);
    text
}

#[cfg(test)]
mod tests {
    use super::*;

    #[test]
    fn pop_player_name_works() {
        let old_text = "bobb".to_shared_string();
        let new_text = pop_player_name(old_text);
        assert_eq!("bob", new_text.as_str());
    }

    #[test]
    fn pop_player_name_works_with_multi_byte_characters() {
        let old_text = "たろうう".to_shared_string();
        let new_text = pop_player_name(old_text);
        assert_eq!("たろう", new_text.as_str());
    }

    #[test]
    fn keyboard_modify_simple() {
        let old_text = "やまた";
        let new_text = keyboard_modify(old_text);
        assert_eq!(new_text, "やまだ");
    }
}
